In [ ]:
## Missing data

In [3]:
import numpy as np
import pandas as pd

In [10]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [11]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [12]:
df = pd.DataFrame(d)

In [14]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
# Borramos por defecto todas las filas que contengan valores NaN
# Con que únicamente tengan un valor nulo se borraran
df.dropna()

     A    B  C
0  1.0  5.0  1

In [15]:
# Borramos todas las columnas que contengan NaN
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [16]:
# Utilizamos el parámetro de la función dropna
# thresh
# Si solo queremos borrar las filas que tengan 2 o más valores nulos, utilizamos este parámetro

df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [17]:
df.dropna(axis=1, thresh = 2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [18]:
# Queremos susituir los valores nulos
df.fillna(value = 'Hello world')

             A            B  C
0            1            5  1
1            2  Hello world  2
2  Hello world  Hello world  3

In [20]:
# Si queremos sustituir el valor concreto de una columna
df['A'].fillna(value = 'Valor')

0        1
1        2
2    Valor
Name: A, dtype: object

In [21]:
# Normalmente algunos valores podemos susituirlos por la media y de esta manera no perder los datos 
# o no reducir nuestro dataset en menos filas

# Fórmula que puede servirnos cuando estamos diseñando algortimos de Machine Learning y tenemos
# valores nulos en nuestras filas

df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [ ]:
# También hay veces que, dependiendo de la naturaleza y forma dde los datos, puede servirnos sustituir
# los valores nulos por la mediana en lugar de la media

In [22]:
df['A'].fillna(value = df['A'].median())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64